GopalSaraf/Practicals/PSDL/include/proc/pic16lf18425.h
extern volatile SMT1TMRHbits_t SMT1TMRHbits __at(0x48D);
// bitfield macros
#define _SMT1TMRH_TMR_POSN                                  0x0
#define _SMT1TMRH_TMR_POSITION                              0x0
#define _SMT1TMRH_TMR_SIZE                                  0x8
#define _SMT1TMRH_TMR_LENGTH                                0x8
#define _SMT1TMRH_TMR_MASK                                  0xFF
#define _SMT1TMRH_TMR8_POSN                                 0x0
#define _SMT1TMRH_TMR8_POSITION                             0x0
#define _SMT1TMRH_TMR8_SIZE                                 0x1
#define _SMT1TMRH_TMR8_LENGTH                               0x1
#define _SMT1TMRH_TMR8_MASK                                 0x1
#define _SMT1TMRH_TMR9_POSN                                 0x1
#define _SMT1TMRH_TMR9_POSITION                             0x1
#define _SMT1TMRH_TMR9_SIZE                                 0x1
#define _SMT1TMRH_TMR9_LENGTH                               0x1
#define _SMT1TMRH_TMR9_MASK                                 0x2
#define _SMT1TMRH_TMR10_POSN                                0x2
#define _SMT1TMRH_TMR10_POSITION                            0x2
#define _SMT1TMRH_TMR10_SIZE                                0x1
#define _SMT1TMRH_TMR10_LENGTH                              0x1
#define _SMT1TMRH_TMR10_MASK                                0x4
#define _SMT1TMRH_TMR11_POSN                                0x3
#define _SMT1TMRH_TMR11_POSITION                            0x3
#define _SMT1TMRH_TMR11_SIZE                                0x1
#define _SMT1TMRH_TMR11_LENGTH                              0x1
#define _SMT1TMRH_TMR11_MASK                                0x8
#define _SMT1TMRH_TMR12_POSN                                0x4
#define _SMT1TMRH_TMR12_POSITION                            0x4
#define _SMT1TMRH_TMR12_SIZE                                0x1
#define _SMT1TMRH_TMR12_LENGTH                              0x1
#define _SMT1TMRH_TMR12_MASK                                0x10
#define _SMT1TMRH_TMR13_POSN                                0x5
#define _SMT1TMRH_TMR13_POSITION                            0x5
#define _SMT1TMRH_TMR13_SIZE                                0x1
#define _SMT1TMRH_TMR13_LENGTH                              0x1
#define _SMT1TMRH_TMR13_MASK                                0x20
#define _SMT1TMRH_TMR14_POSN                                0x6
#define _SMT1TMRH_TMR14_POSITION                            0x6
#define _SMT1TMRH_TMR14_SIZE                                0x1
#define _SMT1TMRH_TMR14_LENGTH                              0x1
#define _SMT1TMRH_TMR14_MASK                                0x40
#define _SMT1TMRH_TMR15_POSN                                0x7
#define _SMT1TMRH_TMR15_POSITION                            0x7
#define _SMT1TMRH_TMR15_SIZE                                0x1
#define _SMT1TMRH_TMR15_LENGTH                              0x1
#define _SMT1TMRH_TMR15_MASK                                0x80
#define _SMT1TMRH_SMT1TMR_POSN                              0x0
#define _SMT1TMRH_SMT1TMR_POSITION                          0x0
#define _SMT1TMRH_SMT1TMR_SIZE                              0x8
#define _SMT1TMRH_SMT1TMR_LENGTH                            0x8
#define _SMT1TMRH_SMT1TMR_MASK                              0xFF
#define _SMT1TMRH_SMT1TMR8_POSN                             0x0
#define _SMT1TMRH_SMT1TMR8_POSITION                         0x0
#define _SMT1TMRH_SMT1TMR8_SIZE                             0x1
#define _SMT1TMRH_SMT1TMR8_LENGTH                           0x1
#define _SMT1TMRH_SMT1TMR8_MASK                             0x1
#define _SMT1TMRH_SMT1TMR9_POSN                             0x1
#define _SMT1TMRH_SMT1TMR9_POSITION                         0x1
#define _SMT1TMRH_SMT1TMR9_SIZE                             0x1
#define _SMT1TMRH_SMT1TMR9_LENGTH                           0x1
#define _SMT1TMRH_SMT1TMR9_MASK                             0x2
#define _SMT1TMRH_SMT1TMR10_POSN                            0x2
#define _SMT1TMRH_SMT1TMR10_POSITION                        0x2
#define _SMT1TMRH_SMT1TMR10_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR10_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR10_MASK                            0x4
#define _SMT1TMRH_SMT1TMR11_POSN                            0x3
#define _SMT1TMRH_SMT1TMR11_POSITION                        0x3
#define _SMT1TMRH_SMT1TMR11_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR11_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR11_MASK                            0x8
#define _SMT1TMRH_SMT1TMR12_POSN                            0x4
#define _SMT1TMRH_SMT1TMR12_POSITION                        0x4
#define _SMT1TMRH_SMT1TMR12_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR12_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR12_MASK                            0x10
#define _SMT1TMRH_SMT1TMR13_POSN                            0x5
#define _SMT1TMRH_SMT1TMR13_POSITION                        0x5
#define _SMT1TMRH_SMT1TMR13_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR13_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR13_MASK                            0x20
#define _SMT1TMRH_SMT1TMR14_POSN                            0x6
#define _SMT1TMRH_SMT1TMR14_POSITION                        0x6
#define _SMT1TMRH_SMT1TMR14_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR14_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR14_MASK                            0x40
#define _SMT1TMRH_SMT1TMR15_POSN                            0x7
#define _SMT1TMRH_SMT1TMR15_POSITION                        0x7
#define _SMT1TMRH_SMT1TMR15_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR15_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR15_MASK                            0x80

// Register: SMT1TMRU
#define SMT1TMRU SMT1TMRU
extern volatile unsigned char           SMT1TMRU            __at(0x48E);
#ifndef _LIB_BUILD
asm("SMT1TMRU equ 048Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned TMR16                  :1;
        unsigned TMR17                  :1;
        unsigned TMR18                  :1;
        unsigned TMR19                  :1;
        unsigned TMR20                  :1;
        unsigned TMR21                  :1;
        unsigned TMR22                  :1;
        unsigned TMR23                  :1;
    };
    struct {
        unsigned SMT1TMR                :8;
    };
    struct {
        unsigned SMT1TMR16              :1;
        unsigned SMT1TMR17              :1;
        unsigned SMT1TMR18              :1;
        unsigned SMT1TMR19              :1;
        unsigned SMT1TMR20              :1;
        unsigned SMT1TMR21              :1;
        unsigned SMT1TMR22              :1;
        unsigned SMT1TMR23              :1;
    };
} SMT1TMRUbits_t;
